[
    {
        "id": 0,
        "companyName": "JNR Incorporated",
        "workType": "Full Time",
        "startDate": "07-2018",
        "endDate": "Current",
        "description": "Building prepaid software incentive solutions for several large enterprise clients. Personally responsible for over fifty complex legacy web sites for enterprise clients. Maintained and migrated all legacy and recently built software sites to adhere to PCI DSS compliance.",
        "developmentTools": "AWS, Docker, GitLab, Wrike, PHPMyAdmin",
        "skills": "NodeJS, PHP 5.2-7, JavaScript, MongoDB, Drupal 6/7, MySQL 5.7, ExpressJS, Laravel v6, VueJS v2, React, CakePHP v1, Codeception, Scrum, Kanban, Continuous Integration, Continuous Deployment",
        "companyURL": "https://www.jnrcorp.com/",
        "companyDescription": "JNR focuses to bolsters a resolute vision: to develop and implement innovative, highly effective events, meetings, and incentive-based reward and loyalty programs that drive sales performance, employee recognition, and consumer behavior."
    },
    {
        "id": 1,
        "companyName": "Terasaki Research Institute",
        "workType": "Contract",
        "startDate": "05-2019",
        "endDate": "04-2020",
        "description": "Developed Wellavive, a React Native mobile application, Laravel API, and Azure infrastructure written in Terraform. Wellavive is a full-stack HIPAA compliant direct-to-patient digital health platform for clinical trial and organ transplant recipient patients.\nWellavive offers patients the convenience of tracking their medication, answering questionnaires for clinics, and logging their symptoms instead of traveling to the clinic.",
        "developmentTools": "Docker",
        "skills": "JavaScript, PHP 7, React Native 0.60, Laravel, MySQL 5.7, Kubernetes, Azure, Jenkins",
        "companyURL": "https://terasaki.org/institute/",
        "companyDescription": ""
    },
    {
        "id": 2,
        "companyName": "Heart Cup Inc",
        "workType": "Contract",
        "startDate": "08-2017",
        "endDate": "05-2019",
        "description": "Developed the Heart Cup social network platform which aimed to promote community driven charitable giving between people and nonprofits.",
        "developmentTools": "Docker",
        "skills": "JavaScript, PHP, SQL",
        "companyURL": "https://www.heartcup.com/",
        "companyDescription": "Heart Cup was founded on the simple idea of connecting people with their communities - one place, one cause, one heart at a time. Heart Cup empowers you to take up causes that you are passionate about. It enables you to make an impact where you think change is needed. This is a place where “likes” have the ability to change lives. So join us on our quest to become a community built on giving!"
    },
    {
        "id": 3,
        "companyName": "Vantage LED",
        "workType": "Full Time",
        "startDate": "06-2016",
        "endDate": "07-2018",
        "description": "Built digital signage media playback software, internal business tooling, IoT Electronic Shelving Label solutions, and virtual/hardware scoreboard integrations.\nDeveloped suite of digital signage media playback software for LED digital signs, LCD televisions, and Electronic Shelving Labels.",
        "developmentTools": "Docker, IntelliJ IDEA, PyCharm, TeamCity",
        "skills": "Python, Java, ActionScript, JavaScript, PHP, C++",
        "companyURL": "https://www.vantageled.com/",
        "companyDescription": "Vantage LED operates in the digital signage industry through designing, engineering, and delivering innovative LED displays driven by revolutionary cloud-based software."
    },
    {
        "id": 4,
        "companyName": "Tribogenics",
        "workType": "Full Time (Summer), Part Time (School in Session)",
        "startDate": "07-2015",
        "endDate": "06-2016",
        "description": "Automated the QA metal alloy identification process for the Watson X-Ray Fluorescence gun through via Android application integration and serial Bluetooth communication to an Arduino powered robot for the intended purpose of validating metal alloy identification to increase accuracy.",
        "developmentTools": "Android Studio, Jira, Pivotal Tracker",
        "skills": "Java, Python",
        "companyURL": "https://www.linkedin.com/company/tribogenics/",
        "companyDescription": "Tribogenics is a transformative X-ray technology company developing affordable and highly portable solutions for materials analysis and imaging. The Tribogenics range of X-ray sources includes the X-Change™ cartridge, the world’s smallest turnkey X-ray source designed for use in revolutionary new XRF systems. Tribogenics was founded in 2011 and employs scientists and engineers at a world-class facility in Los Angeles, CA. Our advisors include luminaries in business, scientific and medical fields. The company is backed by a consortium of investors and recently closed a round led by Nikon and Peter Thiel's Founders Fund."
    }
]
